gpu_chemistry/cases/base/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;


// ************************************************************************* //
